app/controllers/api/feeds_controller.rb

  def index
    @feeds = Feed.all
---
SELECT "feeds".* FROM "feeds"

  def show
    render :json => Feed.find(params[:id]), include: :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 7]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]

  def destroy
    feed = Feed.find(params[:id])
    feed.destroy
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "4"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 4]]

  def favorite
    if favorite = UserFeed.find_by(user: current_user, feed_id: params[:id])
      favorite.destroy
    else
      UserFeed.create(user: current_user, feed_id: params[:id])
    end
    render json: Feed.all
---
SELECT "user_feeds".* FROM "user_feeds" WHERE "user_feeds"."user_id" = 1 AND "user_feeds"."feed_id" = 8 LIMIT 1
DELETE FROM "user_feeds" WHERE "user_feeds"."id" = $1  [["id", 5]]
INSERT INTO "user_feeds" ("created_at", "feed_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 03 Apr 2015 01:08:20 UTC +00:00], ["feed_id", 8], ["updated_at", Fri, 03 Apr 2015 01:08:20 UTC +00:00], ["user_id", 1]]
SELECT "feeds".* FROM "feeds"